tests/data/chargify-webhooks/subscription-product-change.txt

id=54842193&event=subscription_product_change&payload[subscription][activated_at]=2015-10-28%2010%3A33%3A42%20-0400&payload[subscription][balance_in_cents]=0&payload[subscription][cancel_at_end_of_period]=false&payload[subscription][canceled_at]=&payload[subscription][cancellation_message]=&payload[subscription][created_at]=2015-10-28%2010%3A33%3A40%20-0400&payload[subscription][current_period_ends_at]=2015-11-28%2023%3A57%3A13%20-0500&payload[subscription][expires_at]=&payload[subscription][id]=10604899&payload[subscription][next_assessment_at]=2015-11-28%2023%3A57%3A13%20-0500&payload[subscription][next_product_id]=&payload[subscription][payment_collection_method]=automatic&payload[subscription][snap_day]=&payload[subscription][state]=active&payload[subscription][trial_ended_at]=&payload[subscription][trial_started_at]=&payload[subscription][updated_at]=2015-10-29%2000%3A57%3A55%20-0400&payload[subscription][current_period_started_at]=2015-10-29%2000%3A57%3A13%20-0400&payload[subscription][previous_state]=active&payload[subscription][signup_payment_id]=111745277&payload[subscription][signup_revenue]=20.00&payload[subscription][delayed_cancel_at]=&payload[subscription][coupon_code]=&payload[subscription][total_revenue_in_cents]=3639&payload[subscription][product_price_in_cents]=3600&payload[subscription][product_version_number]=2&payload[subscription][payment_type]=credit_card&payload[subscription][referral_code]=&payload[subscription][customer][address]=My%20Street%20123&payload[subscription][customer][address_2]=&payload[subscription][customer][city]=Lulea&payload[subscription][customer][country]=SE&payload[subscription][customer][created_at]=2015-10-28%2010%3A33%3A40%20-0400&payload[subscription][customer][email]=test6%40icoordinator.com&payload[subscription][customer][first_name]=Eric&payload[subscription][customer][id]=10268999&payload[subscription][customer][last_name]=Cartman&payload[subscription][customer][organization]=Designtech&payload[subscription][customer][phone]=&payload[subscription][customer][portal_customer_created_at]=2015-10-28%2010%3A33%3A43%20-0400&payload[subscription][customer][portal_invite_last_accepted_at]=&payload[subscription][customer][portal_invite_last_sent_at]=2015-10-28%2010%3A33%3A43%20-0400&payload[subscription][customer][reference]=&payload[subscription][customer][state]=&payload[subscription][customer][updated_at]=2015-10-28%2010%3A33%3A43%20-0400&payload[subscription][customer][verified]=false&payload[subscription][customer][zip]=&payload[subscription][product][accounting_code]=&payload[subscription][product][archived_at]=&payload[subscription][product][created_at]=2015-09-11%2004%3A44%3A15%20-0400&payload[subscription][product][description]=&payload[subscription][product][expiration_interval]=&payload[subscription][product][expiration_interval_unit]=never&payload[subscription][product][handle]=business-edition&payload[subscription][product][id]=3733220&payload[subscription][product][initial_charge_in_cents]=&payload[subscription][product][interval]=1&payload[subscription][product][interval_unit]=month&payload[subscription][product][name]=Business%20Edition&payload[subscription][product][price_in_cents]=3600&payload[subscription][product][request_credit_card]=true&payload[subscription][product][require_credit_card]=true&payload[subscription][product][return_params]=&payload[subscription][product][taxable]=false&payload[subscription][product][trial_interval]=&payload[subscription][product][trial_interval_unit]=month&payload[subscription][product][trial_price_in_cents]=&payload[subscription][product][update_return_url]=&payload[subscription][product][updated_at]=2015-09-11%2004%3A52%3A27%20-0400&payload[subscription][product][version_number]=2&payload[subscription][product][update_return_params]=&payload[subscription][product][product_family][accounting_code]=&payload[subscription][product][product_family][description]=&payload[subscription][product][product_family][handle]=business-edition&payload[subscription][product][product_family][id]=509765&payload[subscription][product][product_family][name]=Business%20Edition&payload[subscription][product][public_signup_pages][id]=264716&payload[subscription][product][public_signup_pages][return_params]=&payload[subscription][product][public_signup_pages][return_url]=&payload[subscription][product][public_signup_pages][url]=http%3A%2F%2Fic-test.chargify.com%2Fsubscribe%2F6pz9txy3dbyz%2Fbusiness-edition&payload[subscription][credit_card][billing_address]=&payload[subscription][credit_card][billing_address_2]=&payload[subscription][credit_card][billing_city]=&payload[subscription][credit_card][billing_country]=&payload[subscription][credit_card][billing_state]=&payload[subscription][credit_card][billing_zip]=&payload[subscription][credit_card][card_type]=bogus&payload[subscription][credit_card][current_vault]=bogus&payload[subscription][credit_card][customer_id]=10268999&payload[subscription][credit_card][customer_vault_token]=&payload[subscription][credit_card][expiration_month]=12&payload[subscription][credit_card][expiration_year]=2020&payload[subscription][credit_card][first_name]=John&payload[subscription][credit_card][id]=7013209&payload[subscription][credit_card][last_name]=Dow&payload[subscription][credit_card][masked_card_number]=XXXX-XXXX-XXXX-1&payload[subscription][credit_card][vault_token]=1&payload[subscription][credit_card][payment_type]=credit_card&payload[previous_product][accounting_code]=&payload[previous_product][archived_at]=&payload[previous_product][created_at]=2015-09-11%2003%3A48%3A39%20-0400&payload[previous_product][description]=&payload[previous_product][expiration_interval]=&payload[previous_product][expiration_interval_unit]=never&payload[previous_product][handle]=business-edition-trial&payload[previous_product][id]=3733217&payload[previous_product][initial_charge_in_cents]=&payload[previous_product][interval]=1&payload[previous_product][interval_unit]=month&payload[previous_product][name]=Business%20Edition%20-%20Trial&payload[previous_product][price_in_cents]=3600&payload[previous_product][request_credit_card]=true&payload[previous_product][require_credit_card]=false&payload[previous_product][return_params]=&payload[previous_product][taxable]=true&payload[previous_product][trial_interval]=30&payload[previous_product][trial_interval_unit]=day&payload[previous_product][trial_price_in_cents]=0&payload[previous_product][update_return_url]=&payload[previous_product][updated_at]=2015-10-23%2003%3A21%3A12%20-0400&payload[previous_product][version_number]=3&payload[previous_product][update_return_params]=&payload[previous_product][product_family][accounting_code]=&payload[previous_product][product_family][description]=&payload[previous_product][product_family][handle]=business-edition&payload[previous_product][product_family][id]=509765&payload[previous_product][product_family][name]=Business%20Edition&payload[previous_product][public_signup_pages][id]=264715&payload[previous_product][public_signup_pages][return_params]=&payload[previous_product][public_signup_pages][return_url]=&payload[previous_product][public_signup_pages][url]=http%3A%2F%2Fic-test.chargify.com%2Fsubscribe%2F6htqvmjkkw8q%2Fbusiness-edition-trial&payload[site][id]=30257&payload[site][subdomain]=ic-test